package devide_conq;

public class Task_2 {
    /*
    * 1. Имея два отсортированных массива размера m и n соответственно, вам нужно найти элемент,
    который будет находиться на k-й позиции в конечном отсортированном массиве.
    Массив 1 - 100 112 256 349 770
    Массив 2 - 72 86 113 119 265 445 892
    к = 7
    Вывод : 256
    Окончательный отсортированный массив -
    72, 86, 100, 112, 113, 119, 256, 265, 349, 445, 770, 892
    7-й элемент этого массива равен 256.

    2. Имея отсортированный массив arr[] и число x, напишите функцию, которая подсчитывает вхождения x в arr[]
    (сколько раз число x встречается в массиве).
    Ожидаемая временная сложность O(log n)
    arr[] = {1, 1, 2, 2, 2, 2, 3,}
    x = 2
    Вывод: 4 раза*/
}